/*=========================
  ■■■ 배열 ■■■
  - 배열의 배열(2차원 배열)
===========================*/

// 배열의 배열(다차원 배열)을 활용하여
// 다음과 같은 데이터를 요소로 취하는 배열을 구성하고
// 그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*
 n
↓
 1  2  3  4  5		→  i=0		n=1		0부터 출발	[0][0] / [0][1] / [0][2] / [0][3] / [0][4]
 5  1  2  3  4		→  i=1		n=1		1부터 출발			 [1][1] / [1][2] / [1][3] / [1][4] / [1][0]
 4  5  1  2  3		→  i=2		n=1		2부터 출발					  [2][2] / [2][3] / [2][4] / [2][0] / [2][1]	
 3  4  5  1  2		→  i=3		n=1		3부터 출발							   [3][3] / [3][4] / [3][0] / [3][1] / [3][2] 	
 2  3  4  5  1		→  i=4		n=1		0부터 출발										[4][4] / [4][1] / [4][2] / [4][3] / [4][4]			
계속하려면 아무 키나 누르세요...
*/


public class Test083
{
	public static void main(String[] args)
	{
		
//수업풀이
//배열의 배열 선언 및 메모리 할당
		int[][] arr = new int[5][5];
		
		//배열의 배열 각 방에 데이터(요소) 담아내기
		for (int i=0;i<arr.length;i++)			// 웅~ →  0 1 2 3 4      
		{
			for (int j=i, n=1; n<=5; n++)		// 쑝! 
			{									
				
				arr[i][j] = n;					//00 → 1		11 → 1		22 → 1		33 → 1		44 → 1					
				j++;							//01 → 2		12 → 2		23 → 2		33 → 2		40 → 2		
												//02 → 3		13 → 3		24 → 3		33 → 3		41 → 3				
				if(j==5)						//03 → 4		14 → 4		20 → 4		33 → 4		42 → 4					
					j=0;						//04 → 5		10 → 5		21 → 5		33 → 5		44 → 5 			
				
			}
		}

		
		// 출력
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr.length; j++)
		
				System.out.printf("%2d",arr[i][j]);
				System.out.println();
			
		}
	}
}



//내 풀이		
/*
		//배열의 배열 선언 및 메모리 할당
		int[][] arr = new int[5][5];
		
		//배열의 배열 각 방에 데이터(요소) 담아내기
		for (int i=0;i<arr.length;i++)			// 웅~ →  0 1 2 3 4      
		{
			for (int j=i, n=1; n<6; n++)		// 쑝! 
			{									
				
				arr[i][j] = n;					//00 → 1		11 → 1		22 → 1		33 → 1		44 → 1					
				j++;							//01 → 2		12 → 2		23 → 2		33 → 2		40 → 2		
												//02 → 3		13 → 3		24 → 3		33 → 3		41 → 3				
				if(j==5)						//03 → 4		14 → 4		20 → 4		33 → 4		42 → 4					
					j=0;						//04 → 5		10 → 5		21 → 5		33 → 5		44 → 5 			
				
			}
		}

		
		// 출력
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
		
				System.out.printf("%2d",arr[i][j]);
				System.out.println();
			
		}
	}
}*/
		/*
		for (int i=0;i<arr.length;i++)			// 웅~   0 1 2 3 4      
		{
			for (int j=i, n=1; n<=5; n++)		// 쑝!	 1 2 3 4 5
			{
				
				arr[i][j] = n;
				j++;

				if(j==5)
					j=0;
				
			}
		}

		
		// 출력
		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr.length; j++)
		
				System.out.printf("%3d",arr[i][j]);
				System.out.println();
			
		}
	}
}*/

//실행결과
/*
  1  2  3  4  5
  5  1  2  3  4
  4  5  1  2  3
  3  4  5  1  2
  2  3  4  5  1
계속하려면 아무 키나 누르십시오 . . .
*/
